# -- coding: utf-8 --
print('Задание 1')
S = input('Введите строку: ')
print('')

print('Задание 1.i')
print('Третий символ этой строки:', S[2])
print('')

print('Задание 1.ii')
print('Предпоследний символ этой строки:', S[-2])
print('')

print('Задание 1.iii')
print('Первые пять символов этой строки:', S[:5])
print('')

print('Задание 1.iv')
print('Вся строка, кроме последних двух символов:', S[:-2])
print('')

print('Задание 1.v')
print('Все символы с четными индексами:', S[::2])
print('')

print('Задание 1.vi')
print('Все символы с нечетными индексами:', S[1::2])
print('')

print('Задание 1.vii')
print('Все символы в обратном порядке:', S[::-1])
print('')

print('Задание 1.viii')
print('Все символы строки через один в обратном порядке, начиная с последнего:', S[::-2])
print('')

print('Задание 1.ix')
print('Длина данной строки:', len(S))
print('')